In [1]:
import os
import socket
from timeit import default_timer as timer
from glob import glob
import pandas as pd
import pyarrow.parquet as pq

In [2]:
country_code = "US"
print('Country:', country_code)

Country: US

In [3]:
# Local
print('Hostname:', socket.gethostname())
if  'samuel' in socket.gethostname().lower():
    path_to_data='../../data'
# Cluster
else:
    path_to_data='/scratch/spf248/twitter/data'
    
path_to_mentions=os.path.join(path_to_data,'mentions',country_code)
path_to_surveys=os.path.join(path_to_data,'surveys',country_code)
print(path_to_mentions)
print(path_to_surveys)

Hostname: Samuels-MacBook-Pro.local
../../data/mentions/US
../../data/surveys/US

# Twitter Labor Market Indicators

In [4]:
print('Import Mentions Counts')
start = timer()

mentions=pq.ParquetDataset(glob(os.path.join(path_to_mentions,'*.parquet'))).read().to_pandas()
print('# obs:', mentions.shape[0])

print("Done in", round(timer()-start), "sec")

Import Mentions Counts
# obs: 701478
Done in 0 sec

In [5]:
mentions.head()

,year,month,user_location,user_id,hire,offer,loss,unemployed,search
0,2018,11,,2783,0,0,0,0,0
1,2017,1,florida,1,0,0,0,0,0
2,2018,4,iona ‘22,1,0,0,0,0,0
3,2014,10,Pittsburgh PA,3,0,0,0,0,0
4,2011,11,"366 Myrtle Ave, Brooklyn, NY",1,0,0,0,0,0

# Twitter Account Locations Geocoded

In [6]:
locations=pd.read_pickle(os.path.join(path_to_data,'locations','profiles','account-locations.pkl'))

locations=locations[
locations.country_short==country_code].drop(
['n_users','latitude','longitude'],1).reset_index(drop=True)

In [7]:
locations.head()

,user_location,country_long,country_short,locality_long,locality_short,administrative_area_level_1_long,administrative_area_level_1_short,administrative_area_level_2_long,administrative_area_level_2_short
0,New York,United States,US,New York,New York,New York,NY,NaN,NaN
1,Los Angeles,United States,US,Los Angeles,Los Angeles,California,CA,Los Angeles County,Los Angeles County
2,"Los Angeles, CA",United States,US,Los Angeles,Los Angeles,California,CA,Los Angeles County,Los Angeles County
3,Chicago,United States,US,Chicago,Chicago,Illinois,IL,Cook County,Cook County
4,"New York, NY",United States,US,New York,New York,New York,NY,NaN,NaN

# Labor Market Surveys

In [8]:
survey=pd.read_csv(os.path.join(path_to_data,'surveys',country_code+'.csv'))

In [9]:
survey.head()

,year,month,quarter,administrative_area_level_1,administrative_area_level_2,urban_or_rural,unemployed,employed
0,1990,1,1,AL,Autauga County,Both,6.4,NaN
1,1990,2,1,AL,Autauga County,Both,6.6,NaN
2,1990,3,1,AL,Autauga County,Both,5.8,NaN
3,1990,4,2,AL,Autauga County,Both,6.6,NaN
4,1990,5,2,AL,Autauga County,Both,6.0,NaN